adrianwilczynski.user-secrets
chadbaileyvh.oled-pure-black---vscode
github.codespaces
github.vscode-pull-request-github
humao.rest-client
microsoft-aspire.aspire-vscode
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-copilotstudio.vscode-copilotstudio
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.powershell
ms-vscode.vscode-node-azure-pack
ms-windows-ai-studio.windows-ai-studio
teamsdevapp.vscode-ai-foundry
